================================================================================
Simple Annotations
================================================================================

@anno
@(anno1, anno2)
type T;

--------------------------------------------------------------------------------

(cds
  (annotation
    (annotation_path
      (identifier)))
  (annotation
    (annotation_group
      (annotation_group_item
        (annotation_path
          (identifier)))
      (annotation_group_item
        (annotation_path
          (identifier)))))
  (type_definition
    (name
      (identifier))))

================================================================================
Annotation Values: Scalar
================================================================================

@anno: 1
@(anno1: 1, anno2: 2)
type T;

--------------------------------------------------------------------------------

(cds
  (annotation
    (annotation_path
      (identifier))
    (annotation_value
      (number)))
  (annotation
    (annotation_group
      (annotation_group_item
        (annotation_path
          (identifier))
        (annotation_value
          (number)))
      (annotation_group_item
        (annotation_path
          (identifier))
        (annotation_value
          (number)))))
  (type_definition
    (name
      (identifier))))

================================================================================
Annotation Paths
================================================================================

@anno.value.path#variant
@(anno.value.path#variant, anno.value.path#second)
type T;

--------------------------------------------------------------------------------

(cds
  (annotation
    (annotation_path
      (identifier)
      (identifier)
      (identifier)
      (annotation_variant
        (identifier))))
  (annotation
    (annotation_group
      (annotation_group_item
        (annotation_path
          (identifier)
          (identifier)
          (identifier)
          (annotation_variant
            (identifier))))
      (annotation_group_item
        (annotation_path
          (identifier)
          (identifier)
          (identifier)
          (annotation_variant
            (identifier))))))
  (type_definition
    (name
      (identifier))))

================================================================================
Annotation Values: Arrays
================================================================================

@anno: [ ..., 'val', ... up to 'val' ]
type T;

--------------------------------------------------------------------------------

(cds
  (annotation
    (annotation_path
      (identifier))
    (annotation_value
      (annotation_ellipsis_up_to)
      (annotation_value
        (single_quote_string))
      (annotation_ellipsis_up_to
        (annotation_value
          (single_quote_string)))))
  (type_definition
    (name
      (identifier))))

================================================================================
Annotation Values: Structures and Arrays
================================================================================

@anno: {
  @sub: {
    val: [
      { val: null, val: [ 1, 2, 3 ] }
    ]
  }
}
type T;

--------------------------------------------------------------------------------

(cds
  (annotation
    (annotation_path
      (identifier))
    (annotation_value
      (annotation_named_value
        (annotation_path
          (identifier))
        (annotation_value
          (annotation_named_value
            (annotation_path
              (identifier))
            (annotation_value
              (annotation_value
                (annotation_named_value
                  (annotation_path
                    (identifier))
                  (annotation_value
                    (null)))
                (annotation_named_value
                  (annotation_path
                    (identifier))
                  (annotation_value
                    (annotation_value
                      (number))
                    (annotation_value
                      (number))
                    (annotation_value
                      (number)))))))))))
  (type_definition
    (name
      (identifier))))
