================================================================================
Aspect: No Type
================================================================================

aspect A;

--------------------------------------------------------------------------------

(cds
  (aspect_definition
    (name
      (identifier))))

================================================================================
Aspect: No Elements
================================================================================

aspect A {}
aspect B : {}

--------------------------------------------------------------------------------

(cds
  (aspect_definition
    (name
      (identifier))
    (element_definitions))
  (aspect_definition
    (name
      (identifier))
    (element_definitions)))

================================================================================
Aspect: With Elements
================================================================================

aspect A {
  elem: String;
}

--------------------------------------------------------------------------------

(cds
  (aspect_definition
    (name
      (identifier))
    (element_definitions
      (element_definition
        (name)
        (simple_path
          (identifier))))))

================================================================================
Aspect: With Includes
================================================================================

aspect A : B {
  elem: String;
}
aspect A : B, C, D {
  elem: String;
}

--------------------------------------------------------------------------------

(cds
  (aspect_definition
    (name
      (identifier))
    (include_list
      (simple_path
        (identifier)))
    (element_definitions
      (element_definition
        (name)
        (simple_path
          (identifier)))))
  (aspect_definition
    (name
      (identifier))
    (include_list
      (simple_path
        (identifier))
      (simple_path
        (identifier))
      (simple_path
        (identifier)))
    (element_definitions
      (element_definition
        (name)
        (simple_path
          (identifier))))))
