================================================================================
Simple Type
================================================================================

type S : String;

--------------------------------------------------------------------------------

(cds
  (type_definition
    (name
      (identifier))
    (simple_path
      (identifier))))

================================================================================
Simple Type with Type Args
================================================================================

type T : String(length: 10);

--------------------------------------------------------------------------------

(cds
  (type_definition
    (name
      (identifier))
    (simple_path
      (identifier))
    (type_argument
      (identifier)
      (number))))

================================================================================
Type with empty elements
================================================================================

type S : {};
type T {};

--------------------------------------------------------------------------------

(cds
  (type_definition
    (name
      (identifier))
    (element_definitions))
  (type_definition
    (name
      (identifier))
    (element_definitions)))

================================================================================
Type with elements
================================================================================

type S : { e : String; };
type T { e : String; };

--------------------------------------------------------------------------------

(cds
  (type_definition
    (name
      (identifier))
    (element_definitions
      (element_definition
        (name)
        (simple_path
          (identifier)))))
  (type_definition
    (name
      (identifier))
    (element_definitions
      (element_definition
        (name)
        (simple_path
          (identifier))))))

================================================================================
Type Projections
================================================================================

type T1 : projection on E;
type T2 : projection on E { * };
type T3 : projection on E { * } excluding { foo, bar };

--------------------------------------------------------------------------------

(cds
  (type_definition
    (name
      (identifier))
    (projection_clause
      (from_path
        (identifier))))
  (type_definition
    (name
      (identifier))
    (projection_clause
      (from_path
        (identifier))
      (select_item_list
        (select_item))))
  (type_definition
    (name
      (identifier))
    (projection_clause
      (from_path
        (identifier))
      (select_item_list
        (select_item))
      (excluding_clause
        (simple_path
          (identifier))
        (simple_path
          (identifier))))))
